<?php
use Migrations\AbstractSeed;

/**
 * Prefectures seed.
 */
class PrefecturesSeed extends AbstractSeed
{
    /**
     * Run Method.
     *
     * Write your database seeder using this method.
     *
     * More information on writing seeds is available here:
     * https://book.cakephp.org/phinx/0/en/seeding.html
     *
     * @return void
     */
    public function run()
    {
        $data = [
            [
                'id' => '1',
                'name' => '北海道',
                'jis_code' => '1',
                'created' => '1900-01-01 00:00:00',
                'modified' => '1900-01-01 00:00:00',
            ],
            [
                'id' => '2',
                'name' => '青森県',
                'jis_code' => '2',
                'created' => '1900-01-01 00:00:00',
                'modified' => '1900-01-01 00:00:00',
            ],
            [
                'id' => '3',
                'name' => '岩手県',
                'jis_code' => '3',
                'created' => '1900-01-01 00:00:00',
                'modified' => '1900-01-01 00:00:00',
            ],
            [
                'id' => '4',
                'name' => '宮城県',
                'jis_code' => '4',
                'created' => '1900-01-01 00:00:00',
                'modified' => '1900-01-01 00:00:00',
            ],
            [
                'id' => '5',
                'name' => '秋田県',
                'jis_code' => '5',
                'created' => '1900-01-01 00:00:00',
                'modified' => '1900-01-01 00:00:00',
            ],
            [
                'id' => '6',
                'name' => '山形県',
                'jis_code' => '6',
                'created' => '1900-01-01 00:00:00',
                'modified' => '1900-01-01 00:00:00',
            ],
            [
                'id' => '7',
                'name' => '福島県',
                'jis_code' => '7',
                'created' => '1900-01-01 00:00:00',
                'modified' => '1900-01-01 00:00:00',
            ],
            [
                'id' => '8',
                'name' => '茨城県',
                'jis_code' => '8',
                'created' => '1900-01-01 00:00:00',
                'modified' => '1900-01-01 00:00:00',
            ],
            [
                'id' => '9',
                'name' => '栃木県',
                'jis_code' => '9',
                'created' => '1900-01-01 00:00:00',
                'modified' => '1900-01-01 00:00:00',
            ],
            [
                'id' => '10',
                'name' => '群馬県',
                'jis_code' => '10',
                'created' => '1900-01-01 00:00:00',
                'modified' => '1900-01-01 00:00:00',
            ],
            [
                'id' => '11',
                'name' => '埼玉県',
                'jis_code' => '11',
                'created' => '1900-01-01 00:00:00',
                'modified' => '1900-01-01 00:00:00',
            ],
            [
                'id' => '12',
                'name' => '千葉県',
                'jis_code' => '12',
                'created' => '1900-01-01 00:00:00',
                'modified' => '1900-01-01 00:00:00',
            ],
            [
                'id' => '13',
                'name' => '東京都',
                'jis_code' => '13',
                'created' => '1900-01-01 00:00:00',
                'modified' => '1900-01-01 00:00:00',
            ],
            [
                'id' => '14',
                'name' => '神奈川県',
                'jis_code' => '14',
                'created' => '1900-01-01 00:00:00',
                'modified' => '1900-01-01 00:00:00',
            ],
            [
                'id' => '15',
                'name' => '新潟県',
                'jis_code' => '15',
                'created' => '1900-01-01 00:00:00',
                'modified' => '1900-01-01 00:00:00',
            ],
            [
                'id' => '16',
                'name' => '富山県',
                'jis_code' => '16',
                'created' => '1900-01-01 00:00:00',
                'modified' => '1900-01-01 00:00:00',
            ],
            [
                'id' => '17',
                'name' => '石川県',
                'jis_code' => '17',
                'created' => '1900-01-01 00:00:00',
                'modified' => '1900-01-01 00:00:00',
            ],
            [
                'id' => '18',
                'name' => '福井県',
                'jis_code' => '18',
                'created' => '1900-01-01 00:00:00',
                'modified' => '1900-01-01 00:00:00',
            ],
            [
                'id' => '19',
                'name' => '山梨県',
                'jis_code' => '19',
                'created' => '1900-01-01 00:00:00',
                'modified' => '1900-01-01 00:00:00',
            ],
            [
                'id' => '20',
                'name' => '長野県',
                'jis_code' => '20',
                'created' => '1900-01-01 00:00:00',
                'modified' => '1900-01-01 00:00:00',
            ],
            [
                'id' => '21',
                'name' => '岐阜県',
                'jis_code' => '21',
                'created' => '1900-01-01 00:00:00',
                'modified' => '1900-01-01 00:00:00',
            ],
            [
                'id' => '22',
                'name' => '静岡県',
                'jis_code' => '22',
                'created' => '1900-01-01 00:00:00',
                'modified' => '1900-01-01 00:00:00',
            ],
            [
                'id' => '23',
                'name' => '愛知県',
                'jis_code' => '23',
                'created' => '1900-01-01 00:00:00',
                'modified' => '1900-01-01 00:00:00',
            ],
            [
                'id' => '24',
                'name' => '三重県',
                'jis_code' => '24',
                'created' => '1900-01-01 00:00:00',
                'modified' => '1900-01-01 00:00:00',
            ],
            [
                'id' => '25',
                'name' => '滋賀県',
                'jis_code' => '25',
                'created' => '1900-01-01 00:00:00',
                'modified' => '1900-01-01 00:00:00',
            ],
            [
                'id' => '26',
                'name' => '京都府',
                'jis_code' => '26',
                'created' => '1900-01-01 00:00:00',
                'modified' => '1900-01-01 00:00:00',
            ],
            [
                'id' => '27',
                'name' => '大阪府',
                'jis_code' => '27',
                'created' => '1900-01-01 00:00:00',
                'modified' => '1900-01-01 00:00:00',
            ],
            [
                'id' => '28',
                'name' => '兵庫県',
                'jis_code' => '28',
                'created' => '1900-01-01 00:00:00',
                'modified' => '1900-01-01 00:00:00',
            ],
            [
                'id' => '29',
                'name' => '奈良県',
                'jis_code' => '29',
                'created' => '1900-01-01 00:00:00',
                'modified' => '1900-01-01 00:00:00',
            ],
            [
                'id' => '30',
                'name' => '和歌山県',
                'jis_code' => '30',
                'created' => '1900-01-01 00:00:00',
                'modified' => '1900-01-01 00:00:00',
            ],
            [
                'id' => '31',
                'name' => '鳥取県',
                'jis_code' => '31',
                'created' => '1900-01-01 00:00:00',
                'modified' => '1900-01-01 00:00:00',
            ],
            [
                'id' => '32',
                'name' => '島根県',
                'jis_code' => '32',
                'created' => '1900-01-01 00:00:00',
                'modified' => '1900-01-01 00:00:00',
            ],
            [
                'id' => '33',
                'name' => '岡山県',
                'jis_code' => '33',
                'created' => '1900-01-01 00:00:00',
                'modified' => '1900-01-01 00:00:00',
            ],
            [
                'id' => '34',
                'name' => '広島県',
                'jis_code' => '34',
                'created' => '1900-01-01 00:00:00',
                'modified' => '1900-01-01 00:00:00',
            ],
            [
                'id' => '35',
                'name' => '山口県',
                'jis_code' => '35',
                'created' => '1900-01-01 00:00:00',
                'modified' => '1900-01-01 00:00:00',
            ],
            [
                'id' => '36',
                'name' => '徳島県',
                'jis_code' => '36',
                'created' => '1900-01-01 00:00:00',
                'modified' => '1900-01-01 00:00:00',
            ],
            [
                'id' => '37',
                'name' => '香川県',
                'jis_code' => '37',
                'created' => '1900-01-01 00:00:00',
                'modified' => '1900-01-01 00:00:00',
            ],
            [
                'id' => '38',
                'name' => '愛媛県',
                'jis_code' => '38',
                'created' => '1900-01-01 00:00:00',
                'modified' => '1900-01-01 00:00:00',
            ],
            [
                'id' => '39',
                'name' => '高知県',
                'jis_code' => '39',
                'created' => '1900-01-01 00:00:00',
                'modified' => '1900-01-01 00:00:00',
            ],
            [
                'id' => '40',
                'name' => '福岡県',
                'jis_code' => '40',
                'created' => '1900-01-01 00:00:00',
                'modified' => '1900-01-01 00:00:00',
            ],
            [
                'id' => '41',
                'name' => '佐賀県',
                'jis_code' => '41',
                'created' => '1900-01-01 00:00:00',
                'modified' => '1900-01-01 00:00:00',
            ],
            [
                'id' => '42',
                'name' => '長崎県',
                'jis_code' => '42',
                'created' => '1900-01-01 00:00:00',
                'modified' => '1900-01-01 00:00:00',
            ],
            [
                'id' => '43',
                'name' => '熊本県',
                'jis_code' => '43',
                'created' => '1900-01-01 00:00:00',
                'modified' => '1900-01-01 00:00:00',
            ],
            [
                'id' => '44',
                'name' => '大分県',
                'jis_code' => '44',
                'created' => '1900-01-01 00:00:00',
                'modified' => '1900-01-01 00:00:00',
            ],
            [
                'id' => '45',
                'name' => '宮崎県',
                'jis_code' => '45',
                'created' => '1900-01-01 00:00:00',
                'modified' => '1900-01-01 00:00:00',
            ],
            [
                'id' => '46',
                'name' => '鹿児島県',
                'jis_code' => '46',
                'created' => '1900-01-01 00:00:00',
                'modified' => '1900-01-01 00:00:00',
            ],
            [
                'id' => '47',
                'name' => '沖縄県',
                'jis_code' => '47',
                'created' => '1900-01-01 00:00:00',
                'modified' => '1900-01-01 00:00:00',
            ],
        ];

        $table = $this->table('prefectures');
        $table->insert($data)->save();
    }
}